-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: teamproject
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `products` (
  `pnum` int NOT NULL,
  `productName` varchar(50) DEFAULT NULL,
  `title` varchar(100) DEFAULT NULL,
  `status` varchar(20) DEFAULT NULL,
  `sellprice` int DEFAULT NULL,
  `description` varchar(200) DEFAULT NULL,
  `sellerid` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`pnum`),
  KEY `products_1_idx` (`sellerid`),
  CONSTRAINT `products_1` FOREIGN KEY (`sellerid`) REFERENCES `member` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,'손소독제','코로나','판매중',1000,'손소독제','sye'),(2,'마스크','코로나','판매중',1000,'마스크','sye'),(3,'Junit테스트','글제목1 입니다.','판매중',166915,'글내용1 입니다.\n글내용 테스트','abcd'),(4,'Junit테스트','글제목2 입니다.','판매중',664642,'글내용2 입니다.\n글내용 테스트','abcd'),(5,'Junit테스트','글제목3 입니다.','판매중',393522,'글내용3 입니다.\n글내용 테스트','abcd'),(6,'Junit테스트','글제목4 입니다.','판매중',61370,'글내용4 입니다.\n글내용 테스트','abcd'),(7,'Junit테스트','글제목5 입니다.','판매중',876965,'글내용5 입니다.\n글내용 테스트','abcd'),(8,'Junit테스트','글제목6 입니다.','판매중',871143,'글내용6 입니다.\n글내용 테스트','abcd'),(9,'Junit테스트','글제목7 입니다.','판매중',631069,'글내용7 입니다.\n글내용 테스트','abcd'),(10,'Junit테스트','글제목8 입니다.','판매중',912616,'글내용8 입니다.\n글내용 테스트','abcd'),(11,'Junit테스트','글제목9 입니다.','판매중',678888,'글내용9 입니다.\n글내용 테스트','abcd'),(12,'Junit테스트','글제목10 입니다.','판매중',391604,'글내용10 입니다.\n글내용 테스트','abcd'),(13,'Junit테스트','글제목11 입니다.','판매중',986043,'글내용11 입니다.\n글내용 테스트','abcd'),(14,'Junit테스트','글제목12 입니다.','판매중',46587,'글내용12 입니다.\n글내용 테스트','abcd'),(15,'Junit테스트','글제목13 입니다.','판매중',513064,'글내용13 입니다.\n글내용 테스트','abcd'),(16,'Junit테스트','글제목14 입니다.','판매중',562630,'글내용14 입니다.\n글내용 테스트','abcd'),(17,'Junit테스트','글제목15 입니다.','판매중',715704,'글내용15 입니다.\n글내용 테스트','abcd'),(18,'Junit테스트','글제목16 입니다.','판매중',570006,'글내용16 입니다.\n글내용 테스트','abcd'),(19,'Junit테스트','글제목17 입니다.','판매중',892251,'글내용17 입니다.\n글내용 테스트','abcd'),(20,'Junit테스트','글제목18 입니다.','판매중',264740,'글내용18 입니다.\n글내용 테스트','abcd'),(21,'Junit테스트','글제목19 입니다.','판매중',334038,'글내용19 입니다.\n글내용 테스트','abcd'),(22,'Junit테스트','글제목20 입니다.','판매중',138052,'글내용20 입니다.\n글내용 테스트','abcd'),(23,'Junit테스트','글제목21 입니다.','판매중',502347,'글내용21 입니다.\n글내용 테스트','abcd'),(24,'Junit테스트','글제목22 입니다.','판매중',389083,'글내용22 입니다.\n글내용 테스트','abcd'),(25,'Junit테스트','글제목23 입니다.','판매중',282236,'글내용23 입니다.\n글내용 테스트','abcd'),(26,'Junit테스트','글제목24 입니다.','판매중',48413,'글내용24 입니다.\n글내용 테스트','abcd'),(27,'Junit테스트','글제목25 입니다.','판매중',655295,'글내용25 입니다.\n글내용 테스트','abcd'),(28,'Junit테스트','글제목26 입니다.','판매중',658810,'글내용26 입니다.\n글내용 테스트','abcd'),(29,'Junit테스트','글제목27 입니다.','판매중',824040,'글내용27 입니다.\n글내용 테스트','abcd'),(30,'Junit테스트','글제목28 입니다.','판매중',478993,'글내용28 입니다.\n글내용 테스트','abcd'),(31,'Junit테스트','글제목29 입니다.','판매중',200504,'글내용29 입니다.\n글내용 테스트','abcd'),(32,'Junit테스트','글제목30 입니다.','판매중',666471,'글내용30 입니다.\n글내용 테스트','abcd'),(33,'Junit테스트','글제목31 입니다.','판매중',527873,'글내용31 입니다.\n글내용 테스트','abcd'),(34,'Junit테스트','글제목32 입니다.','판매중',432596,'글내용32 입니다.\n글내용 테스트','abcd'),(35,'Junit테스트','글제목33 입니다.','판매중',930071,'글내용33 입니다.\n글내용 테스트','abcd'),(36,'Junit테스트','글제목34 입니다.','판매중',226077,'글내용34 입니다.\n글내용 테스트','abcd'),(37,'Junit테스트','글제목35 입니다.','판매중',41480,'글내용35 입니다.\n글내용 테스트','abcd'),(38,'Junit테스트','글제목36 입니다.','판매중',411942,'글내용36 입니다.\n글내용 테스트','abcd'),(39,'Junit테스트','글제목37 입니다.','판매중',120796,'글내용37 입니다.\n글내용 테스트','abcd'),(40,'Junit테스트','글제목38 입니다.','판매중',164419,'글내용38 입니다.\n글내용 테스트','abcd'),(41,'Junit테스트','글제목39 입니다.','판매중',625068,'글내용39 입니다.\n글내용 테스트','abcd'),(42,'Junit테스트','글제목40 입니다.','판매중',495038,'글내용40 입니다.\n글내용 테스트','abcd'),(43,'Junit테스트','글제목41 입니다.','판매중',847625,'글내용41 입니다.\n글내용 테스트','abcd'),(44,'Junit테스트','글제목42 입니다.','판매중',683241,'글내용42 입니다.\n글내용 테스트','abcd'),(45,'Junit테스트','글제목43 입니다.','판매중',466684,'글내용43 입니다.\n글내용 테스트','abcd'),(46,'Junit테스트','글제목44 입니다.','판매중',626834,'글내용44 입니다.\n글내용 테스트','abcd'),(47,'Junit테스트','글제목45 입니다.','판매중',980836,'글내용45 입니다.\n글내용 테스트','abcd'),(48,'Junit테스트','글제목46 입니다.','판매중',617057,'글내용46 입니다.\n글내용 테스트','abcd'),(49,'Junit테스트','글제목47 입니다.','판매중',722551,'글내용47 입니다.\n글내용 테스트','abcd'),(50,'Junit테스트','글제목48 입니다.','판매중',81349,'글내용48 입니다.\n글내용 테스트','abcd'),(51,'Junit테스트','글제목49 입니다.','판매중',422812,'글내용49 입니다.\n글내용 테스트','abcd'),(52,'Junit테스트','글제목50 입니다.','판매중',206392,'글내용50 입니다.\n글내용 테스트','abcd'),(53,'Junit테스트','글제목51 입니다.','판매중',599295,'글내용51 입니다.\n글내용 테스트','abcd'),(54,'Junit테스트','글제목52 입니다.','판매중',307822,'글내용52 입니다.\n글내용 테스트','abcd'),(55,'Junit테스트','글제목53 입니다.','판매중',831875,'글내용53 입니다.\n글내용 테스트','abcd'),(56,'Junit테스트','글제목54 입니다.','판매중',128592,'글내용54 입니다.\n글내용 테스트','abcd'),(57,'Junit테스트','글제목55 입니다.','판매중',937260,'글내용55 입니다.\n글내용 테스트','abcd'),(58,'Junit테스트','글제목56 입니다.','판매중',114241,'글내용56 입니다.\n글내용 테스트','abcd'),(59,'Junit테스트','글제목57 입니다.','판매중',377466,'글내용57 입니다.\n글내용 테스트','abcd'),(60,'Junit테스트','글제목58 입니다.','판매중',769115,'글내용58 입니다.\n글내용 테스트','abcd'),(61,'Junit테스트','글제목59 입니다.','판매중',975805,'글내용59 입니다.\n글내용 테스트','abcd'),(62,'Junit테스트','글제목60 입니다.','판매중',635677,'글내용60 입니다.\n글내용 테스트','abcd'),(63,'Junit테스트','글제목61 입니다.','판매중',853418,'글내용61 입니다.\n글내용 테스트','abcd'),(64,'Junit테스트','글제목62 입니다.','판매중',842806,'글내용62 입니다.\n글내용 테스트','abcd'),(65,'Junit테스트','글제목63 입니다.','판매중',599274,'글내용63 입니다.\n글내용 테스트','abcd'),(66,'Junit테스트','글제목64 입니다.','판매중',653937,'글내용64 입니다.\n글내용 테스트','abcd'),(67,'Junit테스트','글제목65 입니다.','판매중',372398,'글내용65 입니다.\n글내용 테스트','abcd'),(68,'Junit테스트','글제목66 입니다.','판매중',659808,'글내용66 입니다.\n글내용 테스트','abcd'),(69,'Junit테스트','글제목67 입니다.','판매중',178517,'글내용67 입니다.\n글내용 테스트','abcd'),(70,'Junit테스트','글제목68 입니다.','판매중',142859,'글내용68 입니다.\n글내용 테스트','abcd'),(71,'Junit테스트','글제목69 입니다.','판매중',850319,'글내용69 입니다.\n글내용 테스트','abcd'),(72,'Junit테스트','글제목70 입니다.','판매중',178709,'글내용70 입니다.\n글내용 테스트','abcd'),(73,'Junit테스트','글제목71 입니다.','판매중',420190,'글내용71 입니다.\n글내용 테스트','abcd'),(74,'Junit테스트','글제목72 입니다.','판매중',824895,'글내용72 입니다.\n글내용 테스트','abcd'),(75,'Junit테스트','글제목73 입니다.','판매중',243111,'글내용73 입니다.\n글내용 테스트','abcd'),(76,'Junit테스트','글제목74 입니다.','판매중',288011,'글내용74 입니다.\n글내용 테스트','abcd'),(77,'Junit테스트','글제목75 입니다.','판매중',497750,'글내용75 입니다.\n글내용 테스트','abcd'),(78,'Junit테스트','글제목76 입니다.','판매중',402416,'글내용76 입니다.\n글내용 테스트','abcd'),(79,'Junit테스트','글제목77 입니다.','판매중',737638,'글내용77 입니다.\n글내용 테스트','abcd'),(80,'Junit테스트','글제목78 입니다.','판매중',351496,'글내용78 입니다.\n글내용 테스트','abcd'),(81,'Junit테스트','글제목79 입니다.','판매중',634955,'글내용79 입니다.\n글내용 테스트','abcd'),(82,'Junit테스트','글제목80 입니다.','판매중',35454,'글내용80 입니다.\n글내용 테스트','abcd'),(83,'Junit테스트','글제목81 입니다.','판매중',63603,'글내용81 입니다.\n글내용 테스트','abcd'),(84,'Junit테스트','글제목82 입니다.','판매중',26270,'글내용82 입니다.\n글내용 테스트','abcd'),(85,'Junit테스트','글제목83 입니다.','판매중',818946,'글내용83 입니다.\n글내용 테스트','abcd'),(86,'Junit테스트','글제목84 입니다.','판매중',110092,'글내용84 입니다.\n글내용 테스트','abcd'),(87,'Junit테스트','글제목85 입니다.','판매중',523114,'글내용85 입니다.\n글내용 테스트','abcd'),(88,'Junit테스트','글제목86 입니다.','판매중',599493,'글내용86 입니다.\n글내용 테스트','abcd'),(89,'Junit테스트','글제목87 입니다.','판매중',720898,'글내용87 입니다.\n글내용 테스트','abcd'),(90,'Junit테스트','글제목88 입니다.','판매중',890540,'글내용88 입니다.\n글내용 테스트','abcd'),(91,'Junit테스트','글제목89 입니다.','판매중',378244,'글내용89 입니다.\n글내용 테스트','abcd'),(92,'Junit테스트','글제목90 입니다.','판매중',763731,'글내용90 입니다.\n글내용 테스트','abcd'),(93,'Junit테스트','글제목91 입니다.','판매중',891341,'글내용91 입니다.\n글내용 테스트','abcd'),(94,'Junit테스트','글제목92 입니다.','판매중',564394,'글내용92 입니다.\n글내용 테스트','abcd'),(95,'Junit테스트','글제목93 입니다.','판매중',799124,'글내용93 입니다.\n글내용 테스트','abcd'),(96,'Junit테스트','글제목94 입니다.','판매중',272282,'글내용94 입니다.\n글내용 테스트','abcd'),(97,'Junit테스트','글제목95 입니다.','판매중',967338,'글내용95 입니다.\n글내용 테스트','abcd'),(98,'Junit테스트','글제목96 입니다.','판매중',4530,'글내용96 입니다.\n글내용 테스트','abcd'),(99,'Junit테스트','글제목97 입니다.','판매중',738286,'글내용97 입니다.\n글내용 테스트','abcd'),(100,'Junit테스트','글제목98 입니다.','판매중',573022,'글내용98 입니다.\n글내용 테스트','abcd'),(101,'Junit테스트','글제목99 입니다.','판매중',949213,'글내용99 입니다.\n글내용 테스트','abcd'),(102,'Junit테스트','글제목100 입니다.','판매중',186975,'글내용100 입니다.\n글내용 테스트','abcd'),(103,'Junit테스트','글제목101 입니다.','판매중',835106,'글내용101 입니다.\n글내용 테스트','abcd'),(104,'Junit테스트','글제목102 입니다.','판매중',653041,'글내용102 입니다.\n글내용 테스트','abcd'),(105,'Junit테스트','글제목103 입니다.','판매중',842489,'글내용103 입니다.\n글내용 테스트','abcd'),(106,'Junit테스트','글제목104 입니다.','판매중',45473,'글내용104 입니다.\n글내용 테스트','abcd'),(107,'Junit테스트','글제목105 입니다.','판매중',514470,'글내용105 입니다.\n글내용 테스트','abcd'),(108,'Junit테스트','글제목106 입니다.','판매중',361261,'글내용106 입니다.\n글내용 테스트','abcd'),(109,'Junit테스트','글제목107 입니다.','판매중',739980,'글내용107 입니다.\n글내용 테스트','abcd'),(110,'Junit테스트','글제목108 입니다.','판매중',592713,'글내용108 입니다.\n글내용 테스트','abcd'),(111,'Junit테스트','글제목109 입니다.','판매중',280849,'글내용109 입니다.\n글내용 테스트','abcd'),(112,'Junit테스트','글제목110 입니다.','판매중',381710,'글내용110 입니다.\n글내용 테스트','abcd'),(113,'Junit테스트','글제목111 입니다.','판매중',50232,'글내용111 입니다.\n글내용 테스트','abcd'),(114,'Junit테스트','글제목112 입니다.','판매중',201332,'글내용112 입니다.\n글내용 테스트','abcd'),(115,'Junit테스트','글제목113 입니다.','판매중',131588,'글내용113 입니다.\n글내용 테스트','abcd'),(116,'Junit테스트','글제목114 입니다.','판매중',902569,'글내용114 입니다.\n글내용 테스트','abcd'),(117,'Junit테스트','글제목115 입니다.','판매중',117793,'글내용115 입니다.\n글내용 테스트','abcd'),(118,'Junit테스트','글제목116 입니다.','판매중',546706,'글내용116 입니다.\n글내용 테스트','abcd'),(119,'Junit테스트','글제목117 입니다.','판매중',398883,'글내용117 입니다.\n글내용 테스트','abcd'),(120,'Junit테스트','글제목118 입니다.','판매중',890445,'글내용118 입니다.\n글내용 테스트','abcd'),(121,'Junit테스트','글제목119 입니다.','판매중',747202,'글내용119 입니다.\n글내용 테스트','abcd'),(122,'Junit테스트','글제목120 입니다.','판매중',449298,'글내용120 입니다.\n글내용 테스트','abcd'),(123,'Junit테스트','글제목121 입니다.','판매중',599873,'글내용121 입니다.\n글내용 테스트','abcd'),(124,'Junit테스트','글제목122 입니다.','판매중',265909,'글내용122 입니다.\n글내용 테스트','abcd'),(125,'Junit테스트','글제목123 입니다.','판매중',720794,'글내용123 입니다.\n글내용 테스트','abcd'),(126,'Junit테스트','글제목124 입니다.','판매중',777452,'글내용124 입니다.\n글내용 테스트','abcd'),(127,'Junit테스트','글제목125 입니다.','판매중',41434,'글내용125 입니다.\n글내용 테스트','abcd'),(128,'Junit테스트','글제목126 입니다.','판매중',599782,'글내용126 입니다.\n글내용 테스트','abcd'),(129,'Junit테스트','글제목127 입니다.','판매중',30916,'글내용127 입니다.\n글내용 테스트','abcd'),(130,'스티커','스티커','판매중',1000,'예쁜스티커','abcd'),(131,'마스크','마스크','판매중',1000,'마스크','abcd');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-10-01 23:35:35
